      * CMN copybook
       01  ACCOUNT-RECORD.
           05  ACCT-NO        PIC 9(10).
           05  ACCT-BAL       PIC S9(7)V99.
      * This is a CMN copybook