      ****this is a CMN copybook
       01  ORDER-DETAIL.
           05  ORD-ID         PIC 9(6).
           05  ORD-QTY        PIC 9(4).
           05  ORD-TOTAL      PIC S9(9)V99.