      ****this is a cmn copybook
       05  BASIC-PAY         PIC S9(7)V99.
       05  BONUS-AMT         PIC S9(7)V99.
       05  DEDUCTIONS        PIC S9(7)V99.