      ****this is a CMN copybook
        01  PRODUCT-REC.
           05  PROD-ID        PIC 9(5).
           05  PROD-NAME      PIC X(25).
           05  PROD-PRICE     PIC S9(7)V99.